[
  {
    "id": "1",
    "titleUrl": "building-movie-recommendation-system",
    "title": "Building a Movie Recommendation System: Exploring User-Based, Item-Based, and Content-Based Filtering",
    "description": "Dive into the details of how a movie recommendation system is developed using different approaches and why they're used.",
    "date": "October 24, 2024",
    "readTime": "15 min read",
    "done": "No"
  },
  {
    "id": "2",
    "titleUrl": "creating-ai-customer-assistant-nextjs-gemini-api",
    "title": "Creating an AI-Powered Customer Assistant Using Next.js and Gemini API",
    "description": "Learn how to develop an AI customer assistant leveraging Gemini API and using RAG.",
    "date": "September 28, 2024",
    "readTime": "20 min read",
    "done": "No"
  },
  {
    "id": "3",
    "titleUrl": "developing-ai-voice-assistant",
    "title": "Developing an AI Voice Assistant with Faster Whisper, OpenAI, and Google Text-to-Speech",
    "description": "A breakdown of my project to create an AI voice assistant using popular APIs and models, highlighting the technical aspects of voice recognition and text-to-speech synthesis.",
    "date": "August 30, 2024",
    "readTime": "14 min read",
    "done": "No"
  },
  {
    "id": "4",
    "titleUrl": "leading-orbeats-radio-club",
    "title": "My Experience as Team Leader at University's Radio Club",
    "description": "Reflections on my time as a team leader for my university’s radio club, focusing on event planning, digital content creation, and leadership skills developed.",
    "date": "June 15, 2024",
    "readTime": "10 min read",
    "done": "No"
  },
  {
    "id": "5",
    "titleUrl": "chapter-sf",
    "title": "Chapter SF",
    "description": "relections on 2 weeks in the ai bubble",
    "date": "February 26, 2026",
    "readTime": "8 min read",
    "done": "Yes",
    "image": "https://images.unsplash.com/photo-1455390582262-044cdead277a?auto=format&fit=crop&w=1200&q=80",
    "content": "*a blog for myself and for friends who asked me about the trip*\n\nThis would be my attempt to capture everything that I've seen and learned during my 2 week trip in SF.\n\nI was mainly there to attend a program called Sillicon Valley Fellowship and Treehacks, but it ended up being much more than that.\n\nHere are the highlights of the trip:\n- missed my flight and ended up meeting a wonderful Tunisian family who hosted me in their house\n- Brian Mccan ranch visit and talk\n- founders inc last minute visit\n- Stanford visit and childhood friend reunion\n\n### Serendipity \nYou hear this word thrown around most of the time in SF, but you never really understand it until you stay there for some time.\nYou probably heard that in order to increase your surface of luck, you need to be in the right place at the right time. But what does SF has to do with this?\n\nLet's say you meet a random person in your hometown and you're tinkering with a few projects on the side, what are the probability that the person is in the tech field or investing in startups (pretty low if not zero), this is definitely not the case in SF, you can hear people passing through in the park talking about evaluations and potential board meetings and that changes your whole perspective on how you're going to meet your next investor.\n\nThe beauty of the city is that you don't know you you're going to meet next, while I was attending an event hosted by a Google Deepmind engineer. I was discussing with the person that sat next to me, how we were using ai coding agents at work to their full capacity. Ended up finding out that he attended MIT 12 years ago and was building a fintech startup who just raised series A!\n\n\n### Speed\nPeople move fast here. That's it.\nThe incubation of wealth and resources creates this highly curated network of people who have everything in their hands to make it work. \n\nYour next door neighbor is also building a startup and knows more about OpenClaw then you do. This let people sell, raise and find product market fit faster than any other place on earth. Also the sheer ambitious of the people you're surrounded with makes you feel left behind if you're not keeping up with the speed. Most people would say that there's some sort of performance achievement where if you're not building a YC startup, or have raised some kind of big pre or seed investment you're just ngmi (as they say). \n\nIn some sort of way there's a small micro-economy around AI. Founders sell to other founders. Investors throw money at those other founders. Other founders go back and buy from the founders they sell to. Money keeps circulating in a tight loop until something sticks. But isn't that the full point of whole point of building a company? Maybe the whole point is to keep on shipping until you make it big enough to escape the bubble or maybe it's to make something that people want. In the end both of these converge into the same thing.\n\n\n### 'you can just do things'\nBut I'm not in SF anymore or never have been, what can I do? Should I just wait until I get there to start working?\n\nShorter answer no. Long answer nooooooooo.(joke)\n\nLong answer is: nooooooooo, just keep shipping. \n\nIn a world where the AI race is real, the only real thing left to assess an individual is agency."
  }
]
